QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR64EA48def.inc
.equ USERROW_USERROW0 = 0x1080           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1081           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1082           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1083           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1084           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1085           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1086           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1087           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1088           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1089           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x108A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x108B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x108C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x108D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x108E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x108F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1090          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1091          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1092          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1093          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1094          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1095          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1096          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1097          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1098          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1099          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x109A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x109B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x109C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x109D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x109E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x109F          ; User Row Byte 31
.equ USERROW_USERROW32 = 0x10A0          ; User Row Byte 32
.equ USERROW_USERROW33 = 0x10A1          ; User Row Byte 33
.equ USERROW_USERROW34 = 0x10A2          ; User Row Byte 34
.equ USERROW_USERROW35 = 0x10A3          ; User Row Byte 35
.equ USERROW_USERROW36 = 0x10A4          ; User Row Byte 36
.equ USERROW_USERROW37 = 0x10A5          ; User Row Byte 37
.equ USERROW_USERROW38 = 0x10A6          ; User Row Byte 38
.equ USERROW_USERROW39 = 0x10A7          ; User Row Byte 39
.equ USERROW_USERROW40 = 0x10A8          ; User Row Byte 40
.equ USERROW_USERROW41 = 0x10A9          ; User Row Byte 41
.equ USERROW_USERROW42 = 0x10AA          ; User Row Byte 42
.equ USERROW_USERROW43 = 0x10AB          ; User Row Byte 43
.equ USERROW_USERROW44 = 0x10AC          ; User Row Byte 44
.equ USERROW_USERROW45 = 0x10AD          ; User Row Byte 45
.equ USERROW_USERROW46 = 0x10AE          ; User Row Byte 46
.equ USERROW_USERROW47 = 0x10AF          ; User Row Byte 47
.equ USERROW_USERROW48 = 0x10B0          ; User Row Byte 48
.equ USERROW_USERROW49 = 0x10B1          ; User Row Byte 49
.equ USERROW_USERROW50 = 0x10B2          ; User Row Byte 50
.equ USERROW_USERROW51 = 0x10B3          ; User Row Byte 51
.equ USERROW_USERROW52 = 0x10B4          ; User Row Byte 52
.equ USERROW_USERROW53 = 0x10B5          ; User Row Byte 53
.equ USERROW_USERROW54 = 0x10B6          ; User Row Byte 54
.equ USERROW_USERROW55 = 0x10B7          ; User Row Byte 55
.equ USERROW_USERROW56 = 0x10B8          ; User Row Byte 56
.equ USERROW_USERROW57 = 0x10B9          ; User Row Byte 57
.equ USERROW_USERROW58 = 0x10BA          ; User Row Byte 58
.equ USERROW_USERROW59 = 0x10BB          ; User Row Byte 59
.equ USERROW_USERROW60 = 0x10BC          ; User Row Byte 60
.equ USERROW_USERROW61 = 0x10BD          ; User Row Byte 61
.equ USERROW_USERROW62 = 0x10BE          ; User Row Byte 62
.equ USERROW_USERROW63 = 0x10BF          ; User Row Byte 63

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTB - Virtual Ports
;*************************************************************************

.equ VPORTB_DIR = 0x0004                 ; Data Direction
.equ VPORTB_OUT = 0x0005                 ; Output Value
.equ VPORTB_IN = 0x0006                  ; Input Value
.equ VPORTB_INTFLAGS = 0x0007            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTE - Virtual Ports
;*************************************************************************

.equ VPORTE_DIR = 0x0010                 ; Data Direction
.equ VPORTE_OUT = 0x0011                 ; Output Value
.equ VPORTE_IN = 0x0012                  ; Input Value
.equ VPORTE_INTFLAGS = 0x0013            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

