QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR64EA48def.inc
; EVSYS_CHANNEL4 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL5 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_USERCCLLUT0A masks
.equ EVSYS_USER_gm = 0xFF                ; User channel select group mask
.equ EVSYS_USER_gp = 0                   ; User channel select group position
.equ EVSYS_USER_0_bm = (1<<0)            ; User channel select bit 0 mask
.equ EVSYS_USER_0_bp = 0                 ; User channel select bit 0 position
.equ EVSYS_USER_1_bm = (1<<1)            ; User channel select bit 1 mask
.equ EVSYS_USER_1_bp = 1                 ; User channel select bit 1 position
.equ EVSYS_USER_2_bm = (1<<2)            ; User channel select bit 2 mask
.equ EVSYS_USER_2_bp = 2                 ; User channel select bit 2 position
.equ EVSYS_USER_3_bm = (1<<3)            ; User channel select bit 3 mask
.equ EVSYS_USER_3_bp = 3                 ; User channel select bit 3 position
.equ EVSYS_USER_4_bm = (1<<4)            ; User channel select bit 4 mask
.equ EVSYS_USER_4_bp = 4                 ; User channel select bit 4 position
.equ EVSYS_USER_5_bm = (1<<5)            ; User channel select bit 5 mask
.equ EVSYS_USER_5_bp = 5                 ; User channel select bit 5 position
.equ EVSYS_USER_6_bm = (1<<6)            ; User channel select bit 6 mask
.equ EVSYS_USER_6_bp = 6                 ; User channel select bit 6 position
.equ EVSYS_USER_7_bm = (1<<7)            ; User channel select bit 7 mask
.equ EVSYS_USER_7_bp = 7                 ; User channel select bit 7 position

; EVSYS_USERCCLLUT0B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT2A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT2B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERADC0START masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTB masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTC masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTD masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTE masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTF masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART0IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART1IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART2IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCA0CNTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCA0CNTB masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCA1CNTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCA1CNTB masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB0CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB0COUNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB1CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB1COUNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB2CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB2COUNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB3CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB3COUNT masks
; Masks for EVSYS_USER already defined

; Channel generator select
.equ EVSYS_CHANNEL_OFF_gc = (0x00<<0)    ; Off
.equ EVSYS_CHANNEL_UPDI_SYNCH_gc = (0x01<<0) ; UPDI SYNCH character
.equ EVSYS_CHANNEL_RTC_OVF_gc = (0x06<<0) ; Real Time Counter overflow
.equ EVSYS_CHANNEL_RTC_CMP_gc = (0x07<<0) ; Real Time Counter compare
.equ EVSYS_CHANNEL_RTC_PITEV0_gc = (0x08<<0) ; Periodic Interrupt Timer Event 0
.equ EVSYS_CHANNEL_RTC_PITEV1_gc = (0x09<<0) ; Periodic Interrupt Timer Event 1
.equ EVSYS_CHANNEL_CCL_LUT0_gc = (0x10<<0) ; Configurable Custom Logic LUT0
.equ EVSYS_CHANNEL_CCL_LUT1_gc = (0x11<<0) ; Configurable Custom Logic LUT1
.equ EVSYS_CHANNEL_CCL_LUT2_gc = (0x12<<0) ; Configurable Custom Logic LUT2
.equ EVSYS_CHANNEL_CCL_LUT3_gc = (0x13<<0) ; Configurable Custom Logic LUT3
.equ EVSYS_CHANNEL_AC0_OUT_gc = (0x20<<0) ; Analog Comparator 0 out
.equ EVSYS_CHANNEL_AC1_OUT_gc = (0x21<<0) ; Analog Comparator 1 out
.equ EVSYS_CHANNEL_ADC0_RES_gc = (0x24<<0) ; ADC 0 Result Ready
.equ EVSYS_CHANNEL_ADC0_SAMP_gc = (0x25<<0) ; ADC 0 Sample Ready
.equ EVSYS_CHANNEL_ADC0_WCMP_gc = (0x26<<0) ; ADC 0 Window Compare
.equ EVSYS_CHANNEL_PORTA_EV0_gc = (0x40<<0) ; Port A Event 0
.equ EVSYS_CHANNEL_PORTA_EV1_gc = (0x41<<0) ; Port A Event 1
.equ EVSYS_CHANNEL_PORTB_EV0_gc = (0x42<<0) ; Port B Event 0
.equ EVSYS_CHANNEL_PORTB_EV1_gc = (0x43<<0) ; Port B Event 1
.equ EVSYS_CHANNEL_PORTC_EV0_gc = (0x44<<0) ; Port C Event 0
.equ EVSYS_CHANNEL_PORTC_EV1_gc = (0x45<<0) ; Port C Event 1
.equ EVSYS_CHANNEL_PORTD_EV0_gc = (0x46<<0) ; Port D Event 0
.equ EVSYS_CHANNEL_PORTD_EV1_gc = (0x47<<0) ; Port D Event 1
.equ EVSYS_CHANNEL_PORTE_EV0_gc = (0x48<<0) ; Port E Event 0
.equ EVSYS_CHANNEL_PORTE_EV1_gc = (0x49<<0) ; Port E Event 1
.equ EVSYS_CHANNEL_PORTF_EV0_gc = (0x4A<<0) ; Port F Event 0
.equ EVSYS_CHANNEL_PORTF_EV1_gc = (0x4B<<0) ; Port F Event 1
.equ EVSYS_CHANNEL_USART0_XCK_gc = (0x60<<0) ; USART 0 XCK
.equ EVSYS_CHANNEL_USART1_XCK_gc = (0x61<<0) ; USART 1 XCK
.equ EVSYS_CHANNEL_USART2_XCK_gc = (0x62<<0) ; USART 2 XCK
.equ EVSYS_CHANNEL_SPI0_SCK_gc = (0x68<<0) ; SPI 0 SCK
.equ EVSYS_CHANNEL_TCA0_OVF_LUNF_gc = (0x80<<0) ; Timer/Counter A0 overflow / low byte timer underflow
.equ EVSYS_CHANNEL_TCA0_HUNF_gc = (0x81<<0) ; Timer/Counter A0 high byte timer underflow
.equ EVSYS_CHANNEL_TCA0_CMP0_LCMP0_gc = (0x84<<0) ; Timer/Counter A0 compare 0 / low byte timer compare 0
.equ EVSYS_CHANNEL_TCA0_CMP1_LCMP1_gc = (0x85<<0) ; Timer/Counter A0 compare 1 / low byte timer compare 1
.equ EVSYS_CHANNEL_TCA0_CMP2_LCMP2_gc = (0x86<<0) ; Timer/Counter A0 compare 2 / low byte timer compare 2
.equ EVSYS_CHANNEL_TCA1_OVF_LUNF_gc = (0x88<<0) ; Timer/Counter A1 overflow / low byte timer underflow
.equ EVSYS_CHANNEL_TCA1_HUNF_gc = (0x89<<0) ; Timer/Counter A1 high byte timer underflow
.equ EVSYS_CHANNEL_TCA1_CMP0_LCMP0_gc = (0x8C<<0) ; Timer/Counter A1 compare 0 / low byte timer compare 0
.equ EVSYS_CHANNEL_TCA1_CMP1_LCMP1_gc = (0x8D<<0) ; Timer/Counter A1 compare 1 / low byte timer compare 1
.equ EVSYS_CHANNEL_TCA1_CMP2_LCMP2_gc = (0x8E<<0) ; Timer/Counter A1 compare 2 / low byte timer compare 2
.equ EVSYS_CHANNEL_TCB0_CAPT_gc = (0xA0<<0) ; Timer/Counter B0 capture
.equ EVSYS_CHANNEL_TCB0_OVF_gc = (0xA1<<0) ; Timer/Counter B0 overflow
.equ EVSYS_CHANNEL_TCB1_CAPT_gc = (0xA2<<0) ; Timer/Counter B1 capture
.equ EVSYS_CHANNEL_TCB1_OVF_gc = (0xA3<<0) ; Timer/Counter B1 overflow
.equ EVSYS_CHANNEL_TCB2_CAPT_gc = (0xA4<<0) ; Timer/Counter B2 capture
.equ EVSYS_CHANNEL_TCB2_OVF_gc = (0xA5<<0) ; Timer/Counter B2 overflow
.equ EVSYS_CHANNEL_TCB3_CAPT_gc = (0xA6<<0) ; Timer/Counter B3 capture
.equ EVSYS_CHANNEL_TCB3_OVF_gc = (0xA7<<0) ; Timer/Counter B3 overflow

; Software event on channel select
.equ EVSYS_SWEVENTA_CH0_gc = (0x01<<0)   ; Software event on channel 0
.equ EVSYS_SWEVENTA_CH1_gc = (0x02<<0)   ; Software event on channel 1
.equ EVSYS_SWEVENTA_CH2_gc = (0x04<<0)   ; Software event on channel 2
.equ EVSYS_SWEVENTA_CH3_gc = (0x08<<0)   ; Software event on channel 3
.equ EVSYS_SWEVENTA_CH4_gc = (0x10<<0)   ; Software event on channel 4
.equ EVSYS_SWEVENTA_CH5_gc = (0x20<<0)   ; Software event on channel 5
.equ EVSYS_SWEVENTA_CH6_gc = (0x40<<0)   ; Software event on channel 6
.equ EVSYS_SWEVENTA_CH7_gc = (0x80<<0)   ; Software event on channel 7

; User channel select
.equ EVSYS_USER_OFF_gc = (0x00<<0)       ; Off, No Eventsys Channel connected
.equ EVSYS_USER_CHANNEL0_gc = (0x01<<0)  ; Connect user to event channel 0
.equ EVSYS_USER_CHANNEL1_gc = (0x02<<0)  ; Connect user to event channel 1
.equ EVSYS_USER_CHANNEL2_gc = (0x03<<0)  ; Connect user to event channel 2
.equ EVSYS_USER_CHANNEL3_gc = (0x04<<0)  ; Connect user to event channel 3
.equ EVSYS_USER_CHANNEL4_gc = (0x05<<0)  ; Connect user to event channel 4
.equ EVSYS_USER_CHANNEL5_gc = (0x06<<0)  ; Connect user to event channel 5


;*************************************************************************
;** FUSE - Fuses
;*************************************************************************

